In [2]:
import pandas as pd

In [3]:
df = pd.read_excel("uploads/employee_data_for_pandas_revision.xlsx")

In [4]:
df

,Name,Age,Email,Phone_Number,Country,Salary,Department,Join_Date,Performance_Score
0,Alice Johnson,28,alice.johnson@example.com,(123) 456-7890,USA,72000,Marketing,2020-01-15,A
1,Bob Smith,34,bob.smith@example.com,987-654-3210,USA,85000,Sales,2019-03-22,B
2,Charlie Lee,22,charlie.lee@sample.net,NaN,Canada,50000,Engineering,2021-07-19,C
3,Diana Prince,29,diana.prince@wonder.org,+91-99999-88888,UK,95000,HR,2018-11-30,A
4,Ethan Ray,40,ethan.ray@company.io,555.123.4567,India,67000,Engineering,2022-05-10,B

In [5]:
#Basic Exploration
basic_info = {
    "shape ": df.shape,    #gives the rows x columns number.
    "columns" : df.columns.tolist(),    #gives the headers name in a list.
    "dtypes" : df.dtypes,  #gives the data type of the data stored in each column
    "index" : df.index
}

print(basic_info)

{'shape ': (5, 9), 'columns': ['Name', 'Age', 'Email', 'Phone_Number', 'Country', 'Salary', 'Department', 'Join_Date', 'Performance_Score'], 'dtypes': Name                         object
Age                           int64
Email                        object
Phone_Number                 object
Country                      object
Salary                        int64
Department                   object
Join_Date            datetime64[ns]
Performance_Score            object
dtype: object, 'index': RangeIndex(start=0, stop=5, step=1)}

In [6]:
#Cleaning the data
df.columns = df.columns.str.strip()
df['Phone_Number'] = df['Phone_Number'].str.replace(r'[^0-9]', "", regex=True)
df['Phone_Number'] = df['Phone_Number'].fillna("")
df['Phone_Number'] = df['Phone_Number'].apply(lambda x: x[-10:] if len(x)>10 else x)
df

,Name,Age,Email,Phone_Number,Country,Salary,Department,Join_Date,Performance_Score
0,Alice Johnson,28,alice.johnson@example.com,1234567890,USA,72000,Marketing,2020-01-15,A
1,Bob Smith,34,bob.smith@example.com,9876543210,USA,85000,Sales,2019-03-22,B
2,Charlie Lee,22,charlie.lee@sample.net,,Canada,50000,Engineering,2021-07-19,C
3,Diana Prince,29,diana.prince@wonder.org,9999988888,UK,95000,HR,2018-11-30,A
4,Ethan Ray,40,ethan.ray@company.io,5551234567,India,67000,Engineering,2022-05-10,B

In [16]:
#Filtering and selecting
age_above_30 = df[df['Age'] > 30]
engineering_employees = df[df['Department'] == 'Engineering']
senior_employees = df[df['Join_Date'] < '2020-01-01']

american_origin_employee = df[df['Country'] == 'USA']['Name']. tolist()
print(age_above_30)
print(engineering_employees)
print(senior_employees)

print(f"These are the employees from USA: {american_origin_employee}")

        Name  Age                  Email Phone_Number Country  Salary  \
1  Bob Smith   34  bob.smith@example.com   9876543210     USA   85000
4  Ethan Ray   40   ethan.ray@company.io   5551234567   India   67000

    Department  Join_Date Performance_Score
1        Sales 2019-03-22                 B
4  Engineering 2022-05-10                 B
          Name  Age                   Email Phone_Number Country  Salary  \
2  Charlie Lee   22  charlie.lee@sample.net               Canada   50000
4    Ethan Ray   40    ethan.ray@company.io   5551234567   India   67000

    Department  Join_Date Performance_Score
2  Engineering 2021-07-19                 C
4  Engineering 2022-05-10                 B
           Name  Age                    Email Phone_Number Country  Salary  \
1     Bob Smith   34    bob.smith@example.com   9876543210     USA   85000
3  Diana Prince   29  diana.prince@wonder.org   9999988888      UK   95000

  Department  Join_Date Performance_Score
1      Sales 2019-03-22                 B
3         HR 2018-11-30                 A
These are the employees from USA: ['Alice Johnson', 'Bob Smith']

In [17]:
#Sorting values
df.sort_values('Salary', ascending=False, inplace=True)
df

,Name,Age,Email,Phone_Number,Country,Salary,Department,Join_Date,Performance_Score
3,Diana Prince,29,diana.prince@wonder.org,9999988888,UK,95000,HR,2018-11-30,A
1,Bob Smith,34,bob.smith@example.com,9876543210,USA,85000,Sales,2019-03-22,B
0,Alice Johnson,28,alice.johnson@example.com,1234567890,USA,72000,Marketing,2020-01-15,A
4,Ethan Ray,40,ethan.ray@company.io,5551234567,India,67000,Engineering,2022-05-10,B
2,Charlie Lee,22,charlie.lee@sample.net,,Canada,50000,Engineering,2021-07-19,C

In [20]:
sorted_df =  df.sort_values('Performance_Score', ascending=True)
print(sorted_df)

            Name  Age                      Email Phone_Number Country  Salary  \
3   Diana Prince   29    diana.prince@wonder.org   9999988888      UK   95000
0  Alice Johnson   28  alice.johnson@example.com   1234567890     USA   72000
1      Bob Smith   34      bob.smith@example.com   9876543210     USA   85000
4      Ethan Ray   40       ethan.ray@company.io   5551234567   India   67000
2    Charlie Lee   22     charlie.lee@sample.net               Canada   50000

    Department  Join_Date Performance_Score
3           HR 2018-11-30                 A
0    Marketing 2020-01-15                 A
1        Sales 2019-03-22                 B
4  Engineering 2022-05-10                 B
2  Engineering 2021-07-19                 C

In [23]:
# Calculating the mean, and making aggregation

df['Salary'].mean()
df.groupby("Country")['Salary'].mean().sort_values()

Country
Canada    50000.0
India     67000.0
USA       78500.0
UK        95000.0
Name: Salary, dtype: float64